{
  "events": [
    {
      "start_date": {
        "year": 1993,
        "month": 8
      },
      "end_date": {
        "year": 1996,
        "month": 12
      },
      "text": {
        "headline": "University!!!",
        "text": "In August, 1993, I enrolled at California State University, Sacramento, for my undergraduate studies in Computer Engineering. I underestimated the effect that going to CSU Sacramento would have on my life as living on campus, being a part of that community, and learning to be an adult during my first year of college taught me a lot. Attending a university was one of the greatest achievements of my life and the experience far exceeded what I had expected to come from it."
      },
      "display_date": "August 1993"
    },
    {
      "start_date": {
        "year": 1994,
        "month": 7
      },
      "end_date": {
        "year": 1997,
        "month": 4
      },
      "text": {
        "headline": "Health Care Information Services (Sacramento, CA)",
        "text": "<p>At the end of my first year of college, I saw an advertisement in the school newspaper by a company looking for a programmer. I was desperately in need of a job and to figure out my off-campus life and decided to take a chance. I put together the basic resume that I could and dressed up in a suit and tie and hand-delivered my resume to the office, which conveniently was near to the campus. A few days later, I received the first call from the gentleman who would become my future manager and attended my first interview. A couple of weeks later, after completing a programming assignment and getting a recommendation from one of my Computer Science professors, I had my first programming job!</p><p>Health Care Information Services was a critical step in my development and at a good time. I learned so much more about Computer Science and software development by being able to apply what I was learning in college with the realities of professional work. This was a time when we implemented data structures and algorithms manually, over and over again. I learned about I/O issues, disk performance, computing performance, networks, and so much more. This was a very exciting company to work with. It also helped that the company was designed for student employees and provided great assistance to help us get through school, including helping us to pay our tuition.</p>"
      }
    },
    {
      "start_date": {
        "year": 1997,
        "month": 1
      },
      "text": {
        "headline": "Goodbye and Thanks for the Experience",
        "text": "In January 1997, I learned of the pending closing of my office in Sacramento, CA, and the end of my career at Health Care Information Services. This was both exciting and unfortunate. It was unfortunate because I was going to lose my job. However, as I discovered there was a very hot job market down in the Bay Area that was very ready for me to jump in. Sadly, at this time I decided to put the completion of my Computer Engineering degree on hold. At this point in my life, I needed a job with income and the opportunity to move to the Bay Area was too great."
      },
      "display_date": "January 1997"
    },
    {
      "start_date": {
        "year": 1997,
        "month": 4
      },
      "end_date": {
        "year": 1997,
        "month": 12
      },
      "text": {
        "headline": "Quantal International (Berkeley, CA)",
        "text": "<p>In April 1997, I was hired by Quantal International, Inc., in Berkeley as a senior software engineer. Quantal International is an investment technology firm that at the time was building an investment portfolio optimization solution from a proof-of-concept that had been developed as an Excel workbook. I worked as part of a three-person team to try to build a Windows application for this solution that could be sold to customers.</p><p>My time at Quantal International was far from successful and was my first big failure. I had the technical skills, but I was not the right person for the subject matter. I did not understand the math involved in order to successfully deliver the product and the longer I stayed, the more evident it was becoming that I really was the wrong person for the job.</p>"
      }
    },
    {
      "start_date": {
        "year": 1998,
        "month": 1
      },
      "end_date": {
        "year": 1999,
        "month": 10
      },
      "text": {
        "headline": "PeopleSoft (Pleasanton, CA)",
        "text": "<p>I have very fond memories of PeopleSoft. PeopleSoft is one of those places where you don't realize how great the office environment was until much later, and you can spend your entire career trying to find it again but you never will. PeopleSoft was my life. It was my work life. It was my social life. It was a wonderful place to work.</p><p>I was a Development Manager for the new Enterprise Performance Management product. I worked on financial applications that produced metrics or simulations that could be used to plan financial actions. The applications that we built were extremely fun to work on. I had to learn COBOL when I started at PeopleSoft, but eventually we moved to C++.</p><p>As great as PeopleSoft was, it started becoming a career killer for me. PeopleSoft was very focused on their PeopleTools technology, but Java was just hitting the scene and that's where all of the excitement in Silicon Valley was focusing on. I started becoming unhappy with the technical limitations of my job and wanted to continue to grow in a way that PeopleSoft couldn't support me. I then chose to leave to pursue other opportunities.</p>"
      }
    },
    {
      "start_date": {
        "year": 1999,
        "month": 10
      },
      "end_date": {
        "year": 2001,
        "month": 5
      },
      "text": {
        "headline": "NONSTOP Solutions (San Francisco, CA)",
        "text": "<p>I joined NONSTOP Solutions as a software engineer for several reasons. They were in San Francisco, which seemed exciting to be working right downtown in the financial district. They were building a product using Java, which I was highly interested in. They were my first official startup, were venture backed, and lured me in with the promise of a lot of stock at a very good price. They had so many things that I was looking for. The first office that we weren't in was ok. It was not the best layout, but after another venture round we moved from California Street down to another building on Montgomery and had an extremely beautiful office.</p><p>I learned a lot at NONSTOP Solutions that helped me to advance my career. I learned about the value of mentoring and learning from your peers. I learned (too late) about assigning value to features and ensuring that you're delivering the right value and not just delivering features for the sake of delivering something. I learned about what it means to be a good software architect and how important architecture is, but also how destructive bad architectures can be. I learned that working long hours for the sake of appearance doesn't mean much.</p><p>Shortly ater I left NONSTOP Solutions, the investors stepped in and took control of the company. I heard that the team threw out the existing product under development and rebuilt a new one. The product and the company were eventually sold to Manhattan Associates, and several of my former co-workers still work there.</p>"
      }
    },
    {
      "start_date": {
        "year": 2001,
        "month": 5
      },
      "end_date": {
        "year": 2001,
        "month": 9
      },
      "text": {
        "headline": "Thuridion (Santa Cruz, CA)",
        "text": "<p>Thuridion was a great company. I joined their new sister office in Danville, CA, which was five minutes from my apartment in San Ramon, CA. Thuridion had great people, a great culture, and they just felt like a team. I loved going down to the corporate office in Santa Cruz and working with them. They would have team dinners and they had such an awesome dynamic.</p><p>Unfortunately, like a lot of consulting companies, Thuridion was very much cash-based and this came back to hurt them after the September 11, 2001 attack and the financial crash in the weeks following. Thuridion lost major customers and could no longer afford to maintain the size that they had grown to. The Danville, CA office was shuttered and about half their workforce was let go. I don't think that they ever really recovered from it and I believe they closed their doors eventually in 2014.</p>"
      }
    },
    {
      "start_date": {
        "year": 2001,
        "month": 11
      },
      "end_date": {
        "year": 2002,
        "month": 1
      },
      "text": {
        "headline": "Independent Contractor (Walnut Creek, CA)",
        "text": "<p>Following probably the scariest month of my career with limitied income and resources, I found an opportunity as an independent contractor building a Java-based web product. It didn't pay well, but it paid more than nothing and there were almost no job opportunities at the time, so I was grateful for it.</p><p>Over a three month period, I built the first web version of FLASHCODE, a medical billing application that used ICD, CPT, and HCPCS codes to optimize reimbursement rates for doctors billing Medicare or private insurance providers for reimbursements for patient treatments. The original application was created using File Maker. I learned a lot about scalability, the limitations of XML, and the web and limitations of web UIs on early web browsers while working on this product.</p>"
      }
    },
    {
      "start_date": {
        "year": 2002,
        "month": 2
      },
      "end_date": {
        "year": 2003,
        "month": 4
      },
      "text": {
        "headline": "Kaiser Foundation Health Plan (Oakland, CA)",
        "text": "<p>I joined KP-IT at the beginning of February 2002. KP-IT provided me with the stability of a large company, which I desperately wanted after my experiences over the past six months. I was going to be doing Java and C++ work and leading a team. I was working on Kaiser's internal medical records system that had been under construction by IBM Global Services.</p><p>I met and worked with a lot of great people, and we had some limited success with what we built, but in all honesty, we were not building great things. We were kind of out on the fringe and doing busywork for the most part. A few months after I joined KP-IT, they announced that Kaiser had chosen to stop development on CIS and had purchased software from Epic Software. This was probably a really great idea from my viewpoint.</p><p>The next few months were mostly spent with trying to stay busy. There was very little work to do, and we had the encouragement of the executive doctors to work on open source tech while they figured out what their next step was. We were eventually all invited to interview to join the new organization that would support Epic's application, but I had decided that I was ready to try something new and things were picking up again in the job market, so I took a severance package and moved on.</p>"
      }
    },
    {
      "start_date": {
        "year": 2003,
        "month": 4
      },
      "end_date": {
        "year": 2005,
        "month": 10
      },
      "text": {
        "headline": "JDA Software (Scottsdale, AZ)",
        "text": "<p>On January 1, 2003, I read the San Francisco Chronicle and found a job posting by JDA Software in Arizona looking for software architects and offering full relocation. I decided that I had nothing to lose and applied. I had come to the conclusion that, while I loved the Bay Area, I was ready for something different...someplace new. I didn't know much about Arizona, but it seemed like not a bad option and I'd be close to California if I wanted to come back to see family or move back. After flying down for an interview, I was offered a job to start immediately after my release from KP-IT, and I was packing up and moving to Arizona.</p><p>JDA was a great experience for me. I learned a lot about .NET Development and worked on some interesting problems. I met some very good friends there that I still talk to today. The main negative that I saw was in JDA's culture. JDA had a very uncollaborative culture. Collaboration didn't happen. Departments spent more time fighting with each other and bashing each other instead of working with each other. Meetings with other departments were angry and contentious. I learned that I really didn't like that kind of environment. I loved working with people on solving hard problems for everyone's benefit. I just wasn't getting that there.</p>"
      }
    },
    {
      "start_date": {
        "year": 2005,
        "month": 10
      },
      "end_date": {
        "year": 2008,
        "month": 5
      },
      "text": {
        "headline": "Sogeti USA (Phoenix, AZ)",
        "text": "<p>Sogeti was the beginning of probably the greatest part of my career and life. It all comes down to this dude named Mike Scariano. I forget how, but I saw a job posting for this company called Software Architects looking for developers, so I applied. A few days later I was contacted by their recruiter, did the phone screen, and then came in to meet with them and I met Mike. After the meeting, I went home feeling good about myself only to get home and get an email that they wanted to hold off on moving forward. Ok, I thought. I had nothing to lose. A few days later, I'm going through security at LAX trying to come home from the Microsoft Professional Developer's Conference, and Mike calls me up and next thing I know we're negotiating. In the end, I decide to become a software developer consultant and I began this 14+ year association with Mike Scariano (who really is one of the most awesome people I've ever met, but don't tell him that I wrote that).</p><p>Software Architects was eventually purchased by Sogeti. During my tenure, I think I grew faster than I had earlier in my career. I had the freedom and the opportunity to sell, evangelize, and use new technologies that made for very exciting work. I was having fun.</p><p>Immediately before joining Software Architects, I also met Meleeka &quot;Mea&quot; Burt, who would end up marrying me on October 8, 2006.</p>"
      }
    },
    {
      "start_date": {
        "year": 2008,
        "month": 5
      },
      "end_date": {
        "year": 2011,
        "month": 11
      },
      "text": {
        "headline": "Neudesic (Consulting; Phoenix, AZ)",
        "text": "<p>So here's the thing about Neudesic, the company that I would call home for nearly half of my carreer: I had never heard of them. I remember the first time that I saw one of my very best friends today at an event in the Microsoft office, and I remember the smug thoughts that I had being a part of Sogeti and not Neudesic. Then one day, Mike Scariano departs and ends up at Neudesic. Then a few weeks later, all of my co-workers are talking to Neudesic and leaving. I'm feeling sad, thinking &quot;why isn't Neudesic interested in me?&quot So I told one of my former co-workers to tell their recruiter that I'm interested, and later that day I received a phone call, then a phone interview, and finally a trip to the corporate office in Irvine, CA. And next thing I know, I'm showing up to my first day at Neudesic and the laptop that they gave me was ancient. I ended up buying an &quot;unauthorized&quot; laptop that I would use for the next two years.</p><p>Describing Neudesic is hard. There is no such thing as a perfect place to work. PeopleSoft had a great environment, but the work wasn't 100% fulfilling. NONSTOP had great people, but the business could not produce on the vision. Thuridion had a great culture, but lacked the infrastructure to survive. Neudesic was small and we didn't have a great office, but we built a great culture. We hired fantastic people to work with and learn from. We collaborated. There was also an energy there to succeed; to put in the effort knowing that you were going to build something great. The partners were everywhere. They were building, energizing the team, and keeping everyone focused.</p><p>As a software developer, I continued my ascent that I started at Sogeti. I rapidly caught onto new technologies such as the Clouds and worked on projects that pushed the bleeding edge of Internet technologies. I learned so much and grew so fast, it was amazing. I also rose as our office grew, going from a Principal Consultant to the Practice Director for Custom Application Development for the region.</p>"
      }
    },
    {
      "start_date": {
        "year": 2011,
        "month": 11
      },
      "end_date": {
        "year": 2017,
        "month": 2
      },
      "text": {
        "headline": "Neuron ESB (Neudesic Products)",
        "text": "<p>Life changed for me on January 6, 2011. My first child, a son, was born. I was feeling like I was getting pulled in lots of different directions as a new parent. Fortunately, a fantastic opportunity opened up at just the right time.</p><p>Neudesic has always been investing in product development as a way to diversify their business. In mid-2011, one of Neudesic's original products named Neuron ESB opened up. The development team that worked on Neuron ESB had moved onto another new product that Neudesic was investing in, and nobody was left to work on Neuron. I had been aware of Neuron ESB, but had never really used it, but I decided that I was ready to go back to the stable environment of product development. This opportunity was also 100% remote from my home, so it also gave me the space that I needed to be the parent that I wanted to be to my small and growing family. During my time leading the Neuron ESB development team, I added two daughters to my family. I started my day taking them to school, worked, then picked them up from school at the end of the day, and worked some more. But I truly felt like I was being an involved parent, which was important to me and still is.</p><p>I learned a lot during my time at Neuron. My signature achievement was our CI/CD process that I build by hand. It ran on a four node farm and produced thousands of builds a year. We were able to ship new bug fixes out to customers daily, sometimes within minutes or hours of fixing a bug. I learned a lot about managing customer relationships and customer support working on Neuron, and solving problems in an environment that I had no access to. I also learned a lot about speed and agility and being able to respond as value propositions rapidly changed.</p><p>Towards the end of 2016, after five years on the Neuron ESB team, I started to come to the conclusion that I had given everything that I had for the product. There was another member of my team, a very good friend, who had more passion for the newer development ideas than I had. I felt that it was the right time to hand over the reigns and go find my next adventure. What was important is that I left the product in a better state than when I started. I achieved everything that I had set out to do and more.</p>"
      }
    },
    {
      "start_date": {
        "year": 2017,
        "month": 3
      },
      "text": {
        "headline": "Neudesic (Consulting; Tempe, AZ)",
        "text": "<p>In March 2017, I joined Neudesic...wait...what? Yes, I transfered back to consulting. I think I may be the first person in company history to go from consulting to product development and back to consulting. They missed me. They asked me to come back. At the holiday party they tried getting me drunk in order to sign a commitment letter, but unfortunately they forgot that I don't drink. But I did think about it and decided to make the leap back, and I think that it was a good decision.</p><p>They say that you can never go home again, and I would agree with that, but the Phoenix office that I left and the Phoenix office that I returned to are two separate homes. I came back as the Integration Lead for Southwest, because that made sense and they didn't know where else to put me. I have eventually become a Technical Client Director. But I'm back working on sales and delivering projects for customers, and fighting the political fights that matter. But I have a completely different team and another Michael to deal with. So here I am.</p><p>What can I say, Neudesic is a great company, and it's a privilege to be a part of this team working every day to achieve something great.</p>"
      }
    }
  ],
  "title": {
    "start_date": {
      "year": 1993,
      "month": 8
    },
    "text": {
      "headline": "My Professional Story",
      "text": "This timeline is to help you understand the journey that I have taken in my professional carrer and to help you to understand how I arrived at this current moment in my career."
    }
  }
}