{
	"timeline": {
		"headline": "About Michael F. Collins, III",
		"type": "default",
		"text": "<p>To help you learn more about me, here is a timeline-based autobiography showing the major events of my education, personal life, and professional career.</p>",
		"date": [
			{
				"startDate": "1975,1,31",
				"headline": "It All Started Here",
				"text": "<p>I was born in Los Angeles, CA, at Ceders Sinai Hospital in Los Angeles, CA, to an Irish-American family.</p>",
				"tag": "personal"
			},
			{
				"startDate": "1982,10,1",
				"headline": "San Ramon, CA",
				"text": "<p>When I was seven years old and just started the second grade, my family relocated from Los Angeles, CA, to San Ramon, CA. Little did I know how important San Ramon would become to me at the time that we originally moved there.",
				"tag": "personal"
			},
			{
				"startDate": "1985,6,30",
				"headline": "Cow Town, USA!",
				"text": "<p>After finishing the fourth grade and my parents divorced, my mother, sister, and I moved to Dixon, CA. Dixon was the smallest town that I had ever lived in and was located north of San Ramon in Solano County.</p><p>Dixon was an interesting place to grow up. The city and I did not have much in common. However, I am very fond of many of the people that I met there and may of them had a significant effect on my development into an adult, and I am often grateful for their contributions to my life.</p><p>I graduated from Dixon High School in June, 1993.</p>",
				"tag": "personal"
			},
			{
				"startDate": "1993,9,1",
				"endDate": "1996,12,15",
				"headline": "California State University, Sacramento",
				"text": "<p>I attended California State University, Sacramento, and studied Computer Engineering while there. All that I remember during high school was that I could not wait to get to college, but then once at college my fortunes changed and I began my career shortly after my freshman year. I would like to say that I learned a lot at college that shaped what I have done in my professional career, but the truth is that I learned more in the three years of working than I did in the nearly four years at the University. However, I did very much enjoy my time at CSU Sacramento.</p>",
				"tag": "college"
			},
			{
				"startDate": "1994,7,1",
				"endDate": "1997,4,1",
				"headline": "HealthCare Information Services",
				"text": "<p><strong>Production Programmer; Software Engineer</strong></p><p>I began working for HealthCare Information Services, or HCIS, during the summer after my freshman year at CSU Sacramento. This was my first professional software development position. I started working as a Production Programmer for $8 per hour. My job responsibilities focused on building product databases containing MEDLINE citation data from the National Library of Medicine. Every month, I would update the product databases and then supervise the creation of the CD-ROMs that we sent to customers.</p><p>I developed software using Pascal, C, and C++ for HCIS, and I learned a tremendous amount about how to develop software from the people that I worked with here.</p>",
				"tag": "career"
			},
			{
				"startDate": "1997,4,1",
				"endDate": "1997,12,31",
				"headline": "Quantal International",
				"text": "<p><strong>Senior Software Engineer</strong></p><p>I joined Quantal International as a Senior Software Developer after HCIS relocated to Philadelphia, PA, in April 1997. The partners at Quantal had created a stock portfolio optimization engine using Microsoft Excel spreadsheets. They were looking for me to help them productize the mathematics in the spreadsheet. What the product did was very cool, but in the end it turned out to not be a good fit for either of us. This was a job opportunity that I was not quite ready for and was in over my head with the finance and mathematics. I decided to start the new year fresh.</p><p>I use C++ and the MFC framework during my time at Quantal.</p>",
				"tag": "career"
			},
			{
				"startDate": "1998,1,1",
				"endDate": "1999,10,1",
				"headline": "PeopleSoft",
				"text": "<p><strong>Development Manager</strong></p><p>PeopleSoft was by far one of the best companies that I ever worked for. I was there for the opening of their corporate campus in Pleasanton, CA, and I loved working there. The people that I worked with were awesome and I was pushed to create some really innovative technological solutions for the product. I was present for the first three releases of the Enterprise Performance Management product. My responsibility was to create financial analytic engines that would analyze mortgage information and output financial measures for different financial products or investment decisions. While I dearly loved working for PeopleSoft, I decided in the end that PeopleSoft was going to be a career killer for me. Java was coming on strong and I really wanted to be developing next generation enterprise solution technology using it. That opportunity was not there for me at PeopleSoft.</p><p>I developed software for PeopleSoft using COBOL, C++, and PeopleTools.</p>",
				"tag": "career"
			},
			{
				"startDate": "1998,3,1",
				"endDate": "2003,4,1",
				"headline": "Welcome Home!",
				"text": "<p>After joining PeopleSoft in January, I returned home to San Ramon, CA, and spent the next five years living there. San Ramon is one of my favorite places, and I look forward to my third tenure living there sometime when I can afford to buy a house there. Come on Powerball!</p>",
				"tag": "personal"
			},
			{
				"startDate": "1999,10,1",
				"endDate": "2001,5,1",
				"headline": "NONSTOP Solutions",
				"text": "<p><strong>Software Architect</strong></p><p>NONSTOP Solutions was focused on demand chain optimization with their SCORE product. SCORE was an AS/400 RPG-based system that helped pharmaceutical companies to manage the flow of their products from manufacturing to distribution centers to store shelves. I worked as a software architect creating value-added solutions for SCORE. I led the development effort of B2B marketplaces using webMethods that would integrate buyers and sellers using the SCORE product to allow for the advertising of and purchasing of goods over the marketplace. I also consulted with the development team in Atlanta, GA, on the creation of a Windows client for SCORE.</p><p>I used Java, C++, MFC, and XML technologies for the solutions that I created for NONSTOP Solutions.</p>",
				"tag": "career"
			},
			{
				"startDate": "2001,5,1",
				"endDate": "2001,9,20",
				"headline": "Thuridion",
				"text": "<p><strong>Technical Lead</strong></p><p>Thuridion was a dream company to work for. I have never been involved in such a close, family-oriented culture before or since. I joined Thuridion to work in their new Danville, CA, office as a software consultant. I worked on ASP applications for several customers and helped with internal research of the emerging Microsoft .NET Framework for Windows applications.</p><p>Thuridion's business was impacted significantly following the September 11, 2001 terrorist attacks and subsequent stock market crash. As a result, the Danville extension office was closed and Thuridion and I parted ways.</p>",
				"tag": "career"
			},
			{
				"startDate": "2001,11,1",
				"endDate": "2002,1,31",
				"headline": "Flash Code",
				"text": "<p>After a little over a month of searching for a job in the meltdown of the .com boom, I landed an independent project working on a new version of a product named Flash Code. Flash Code was created by a doctor for the Mac and he had visions of turning Flash Code into a web application that could attract more users. Flash Code is used for medical billing for Medicare and private insurance companies. Flash Code uses ICD codes to identify medical diagnoses for patients and CPT or HCPCS codes that represent the prescribed treatments. Together these codes are associated with a monetary value that control how much doctors or hospitals will be paid for the services rendered. Flash Code is still in use today.</p><p>I used Java and J2EE technologies to build the initial version of the Flash Code web product.</p>",
				"tag": "career"
			},
			{
				"startDate": "2002,02,1",
				"endDate": "2003,04,1",
				"headline": "Kaiser Foundation Health Plan",
				"text": "<p><strong>Technical Lead</strong></p><p>I returned to the world of full-time employment in February 2002 working on the KP-CIS project for Kaiser Foundation Health Plan. KP-CIS was Kaiser's attempt at creating an electronic medical records system that would standardize their record management systems across all of the Kaiser regions. It turned out that I joined during the last stages of the project. New executive management that started shortly after I did decided to change directions and purchase a commercial product, and I decided to take advantage of the severance package to relocate to Arizona.</p><p>I primarily used Java with occasional C++ during my time at Kaiser.</p>",
				"tag": "career"
			},
			{
				"startDate": "2003,04,1",
				"endDate": "2005,10,1",
				"headline": "JDA Software",
				"text": "<p><strong>Software Architect</strong></p><p>I relocated from San Ramon, CA, to Scottsdale, AZ, to begin my career with JDA Software. I joined the Portfolio Framework team that focused on creating the technology platform that JDA's product teams would use to build an integrated .NET-based solution for their customers. My team was intended to focus on solving the hard technology problems so that the application teams could focus on building the business value.</p><p>During my time at JDA, I developed software primarily using C# and the Microsoft .NET Framework, with occasional C++ development. I also implemented and managed the automated build process for the framework software.</p>",
				"tag": "career"
			},
			{
				"startDate": "2005,3,25",
				"headline": "The Date with Destiny...er...Mea",
				"text": "<p>This is the date that I met my future wife at a Starbucks. My wallet and bank accounts have never recovered.</p>",
				"tag": "personal"
			},
			{
				"startDate": "2005,10,1",
				"endDate": "2008,05,19",
				"headline": "Sogeti USA",
				"text": "<p><strong>Senior Consultant; Practice Director, Custom Application Development</strong></p><p>I originally joined Software Architects as a consultant, but continued to work for the company after it was acquired and merged with Sogeti USA. I focused on developing software using the Microsoft .NET Framework for customers in the Phoenix area. After our acquisition by Sogeti USA, I took more of a leadership role in helping to build our custom application development practice and was responsible for interviewing and recommending new hires. I also worked to ensure that our consultants were trained, at one point seeing 14 consultants take and pass the first Microsoft .NET certification exam.</p><p>The majority of the software that I developed for Sogeti customers used C# and Microsoft .NET Framework, with occasional C++ development work. I also worked extensively with Microsoft's WCF, WF, and WPF technologies.</p>",
				"tag": "career"
			},
			{
				"startDate": "2006,10,8",
				"headline": "Wedding Bells!",
				"text": "<p>Meleeka Burt became Meleeka Collins on the lake at the Charthouse Restaurant in Scottsdale, AZ. The other big milestone of this event was that we almost had the entire Collins/Stratton/Howard clan in one location and I have an awesome family picture to remember that event.</p>",
				"tag": "personal"
			},
			{
				"startDate": "2008,05,19",
				"headline": "Neudesic",
				"text": "<p><strong>Principal Consultant; Practice Director, Custom Application Development; Product Architect, Neuron ESB</strong></p><p>I left Sogeti to join the rapidly expanding Neudesic office in Phoenix in May, 2008. I originally joined as a Principal Consultant but eventually grew into the role of Practice Director for the Desert region. As a consultant, I have been involved in several innovative solutions for customers such as live-streaming audio and video over the Internet (I also participated in a patent application related to this solution) and the creation of a sales platform for insurance products. I was also heavily involved in sales for the region. During my tenure as Practice Director, I helped to grow the team to 15 software developers and grew revenue for my practice to close to $2 million dollars.</p><p>In November, 2011, I switched roles and returned to product development by taking over development for Neudesic's Neuron Enterprise Service Bus product. My work led to the first major upgrade of Neuron ESB in nearly 5 years as Neuron ESB 3.0 was released in early 2013. I continue to work on innovative new features for Neuron ESB.</p><p>I celebrated a milestone 5-year anniversary with Neudesic on May 19, 2013.</p><p>I have used C#, C++, Objective-C, Flash/Flex/ActionScript, JavaScript, HTML5, and other web technologies during my time at Neudesic.</p>",
				"tag": "career"
			},
			{
				"startDate": "2011,11,1",
				"headline": "Back to Product Development",
				"text": "<p>I officially switched from consultant to product developer again taking over development of Neudesic's Neuron Enterprise Service Bus product.</p>",
				"tag": "career"
			},
			{
				"startDate": "2011,1,6",
				"headline": "IV",
				"text": "<p>Michael Francis Collins, IV, was born at 3:23am at Scottsdale Shea Medical Center. This one event changed my life like no other, and I have never missed not being a father.</p>",
				"tag": "personal"
			}
		]
	}
}